harishankarn04/MIMXRT1064_Project_LED/device/periph/PERI_OCOTP.h
/*! @name MISC_CONF0 - Value of OTP Bank5 Word5 (Misc Conf) */
/*! @{ */

#define OCOTP_MISC_CONF0_BITS_MASK               (0xFFFFFFFFU)
#define OCOTP_MISC_CONF0_BITS_SHIFT              (0U)
/*! BITS - BITS */
#define OCOTP_MISC_CONF0_BITS(x)                 (((uint32_t)(((uint32_t)(x)) << OCOTP_MISC_CONF0_BITS_SHIFT)) & OCOTP_MISC_CONF0_BITS_MASK)
/*! @} */

/*! @name MISC_CONF1 - Value of OTP Bank5 Word6 (Misc Conf) */
/*! @{ */

#define OCOTP_MISC_CONF1_BITS_MASK               (0xFFFFFFFFU)
#define OCOTP_MISC_CONF1_BITS_SHIFT              (0U)
/*! BITS - BITS */
#define OCOTP_MISC_CONF1_BITS(x)                 (((uint32_t)(((uint32_t)(x)) << OCOTP_MISC_CONF1_BITS_SHIFT)) & OCOTP_MISC_CONF1_BITS_MASK)
/*! @} */

/*! @name SRK_REVOKE - Value of OTP Bank5 Word7 (SRK Revoke) */
/*! @{ */

#define OCOTP_SRK_REVOKE_BITS_MASK               (0xFFFFFFFFU)
#define OCOTP_SRK_REVOKE_BITS_SHIFT              (0U)
/*! BITS - BITS */
#define OCOTP_SRK_REVOKE_BITS(x)                 (((uint32_t)(((uint32_t)(x)) << OCOTP_SRK_REVOKE_BITS_SHIFT)) & OCOTP_SRK_REVOKE_BITS_MASK)
/*! @} */

/*! @name GP30 - Value of OTP Bank7 Word0 (GP3) */
/*! @{ */

#define OCOTP_GP30_BITS_MASK                     (0xFFFFFFFFU)
#define OCOTP_GP30_BITS_SHIFT                    (0U)
/*! BITS - BITS */
#define OCOTP_GP30_BITS(x)                       (((uint32_t)(((uint32_t)(x)) << OCOTP_GP30_BITS_SHIFT)) & OCOTP_GP30_BITS_MASK)
/*! @} */

/*! @name GP31 - Value of OTP Bank7 Word1 (GP3) */
/*! @{ */

#define OCOTP_GP31_BITS_MASK                     (0xFFFFFFFFU)
#define OCOTP_GP31_BITS_SHIFT                    (0U)
/*! BITS - BITS */
#define OCOTP_GP31_BITS(x)                       (((uint32_t)(((uint32_t)(x)) << OCOTP_GP31_BITS_SHIFT)) & OCOTP_GP31_BITS_MASK)
/*! @} */

/*! @name GP32 - Value of OTP Bank7 Word2 (GP3) */
/*! @{ */

#define OCOTP_GP32_BITS_MASK                     (0xFFFFFFFFU)
#define OCOTP_GP32_BITS_SHIFT                    (0U)
/*! BITS - BITS */
#define OCOTP_GP32_BITS(x)                       (((uint32_t)(((uint32_t)(x)) << OCOTP_GP32_BITS_SHIFT)) & OCOTP_GP32_BITS_MASK)
/*! @} */

/*! @name GP33 - Value of OTP Bank7 Word3 (GP3) */
/*! @{ */

#define OCOTP_GP33_BITS_MASK                     (0xFFFFFFFFU)
#define OCOTP_GP33_BITS_SHIFT                    (0U)
/*! BITS - BITS */
#define OCOTP_GP33_BITS(x)                       (((uint32_t)(((uint32_t)(x)) << OCOTP_GP33_BITS_SHIFT)) & OCOTP_GP33_BITS_MASK)
/*! @} */

/*! @name GP40 - Value of OTP Bank7 Word4 (GP4) */
/*! @{ */

#define OCOTP_GP40_BITS_MASK                     (0xFFFFFFFFU)
#define OCOTP_GP40_BITS_SHIFT                    (0U)
/*! BITS - BITS */
#define OCOTP_GP40_BITS(x)                       (((uint32_t)(((uint32_t)(x)) << OCOTP_GP40_BITS_SHIFT)) & OCOTP_GP40_BITS_MASK)
/*! @} */

/*! @name GP41 - Value of OTP Bank7 Word5 (GP4) */
/*! @{ */

#define OCOTP_GP41_BITS_MASK                     (0xFFFFFFFFU)
#define OCOTP_GP41_BITS_SHIFT                    (0U)
/*! BITS - BITS */
#define OCOTP_GP41_BITS(x)                       (((uint32_t)(((uint32_t)(x)) << OCOTP_GP41_BITS_SHIFT)) & OCOTP_GP41_BITS_MASK)
/*! @} */

/*! @name GP42 - Value of OTP Bank7 Word6 (GP4) */
/*! @{ */

#define OCOTP_GP42_BITS_MASK                     (0xFFFFFFFFU)
#define OCOTP_GP42_BITS_SHIFT                    (0U)
/*! BITS - BITS */
#define OCOTP_GP42_BITS(x)                       (((uint32_t)(((uint32_t)(x)) << OCOTP_GP42_BITS_SHIFT)) & OCOTP_GP42_BITS_MASK)
/*! @} */

/*! @name GP43 - Value of OTP Bank7 Word7 (GP4) */
/*! @{ */

#define OCOTP_GP43_BITS_MASK                     (0xFFFFFFFFU)
#define OCOTP_GP43_BITS_SHIFT                    (0U)
/*! BITS - BITS */
#define OCOTP_GP43_BITS(x)                       (((uint32_t)(((uint32_t)(x)) << OCOTP_GP43_BITS_SHIFT)) & OCOTP_GP43_BITS_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group OCOTP_Register_Masks */


/*!
 * @}
 */ /* end of group OCOTP_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_OCOTP_H_ */

